# include <stdio.h>
int main(void)
{
    int a[5];
    int i;

    scanf("%d", &a[0]);
    printf("a[0] = %d\n", a[0]); //给a[0]赋值

    scanf("%d", &a[3]);
    printf("a[3] = %d\n", a[3]);

    for (i=0; i<5; ++i)
        printf("%d  ", a[i]);
    //vc6.0的结果是:4  -858993460  -858993460  7  -858993460
    //codeblocks的结果:4  4200830  4200736  7  8

    return 0;
}
/*
  如何定义一维数组
    为n个变量连续分配存储空间
    所有的变量数据类型必须相同
    所有变量所占的字节大小必须相等
*/
/*
  关于一维数组的操作
      初始化
          完全初始化
              int a[5] = {1, 2, 3, 4, 5};
          不完全初始化, 未被初始化的元素自动为零
              int a[5] = {1, 2, 3};
          不初始化, 所有元素是垃圾值
              int a[5];
          清零
              int a[5] = 0;
          错误写法;
              int a[5];
              a[5] = {1, 2, 3, 4, 5};//错误
              只有在定义数组的同时才可以整体赋值,
              其他情况下整体赋值都是错误的,此时都叫下标(表明元素的位置叫下标,如a[1])
*/
/*
  错误案例:
  int a[5] = {1, 2, 3, 4, 5};
  a[5] = 100; //error 因为没有a[5]这个元素,最大只到a[4];
*/
/*
  int a[5] = {1, 2, 3, 4, 5};
  int b[5];
  如果要把a数组中的值全部赋值给b数组
      错误的写法:
      b = a;//error
      正确的写法:
      for (i=0; i<5; ++i)
          b[i] = a[i];
*/
