/*
二维数组:
int a[3][4]
总共是12个元素,可以当作三行四列看待,这十二个元素的名字依次是
 a[0][0]  a[0][1]  a[0][2]  a[0][3]
 a[1][0]  a[1][1]  a[1][2]  a[1][3]
 a[2][0]  a[2][1]  a[2][2]  a[2][3]
 a[i][j]  表示第i+1行第j+1列的元素
 int a[m][n]; 该二维数组最大位置的元素只能是a[m-1][n-1]
*/
/*
初始化
    int a[3][4] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12};
    int a[3][4] = {
             {1, 2, 3, 4},
             {5, 6, 7, 8},
             {9, 10,11,12}
    };
*/
/*
输出二维数组的内容:
*/
# include <stdio.h>

int main(void)
{
    int a[3][4] = {
        {1, 2, 3, 4},
        {5, 6, 7, 8},
        {9, 10,11,12}
    };

    int i, j;

    //输出数组内容
    for (i=0; i<3; ++i)
    {
        for (j=0; j<4; ++j)
            printf("%-5d", a[i][j]);//对齐的方法
        printf("\n");
    }

    return 0;
}
