# include <stdio.h>

int main (void)
{
	int i;
	int j;
	int k;
	int m;

	i = j = 3;//等价于i = 3; j = 3;
	k = i++;// 整体表达式等于i加1之前的值,而i加了1; k为整体表达式
	m = ++j;// 整体表达式等于j加1之后的值

	printf("i = %d, j = %d, k = %d, m = %d\n", i, j, k, m);

	return 0;
}
/*
    在vc++6.0的输出结果是:
------------------------------
    i = 4, j = 4, k = 3, m = 4
------------------------------
    1. 尽量不要使用前后自增的差别
	2. i++ 和 ++i 单独成一个语句,不要把它作为一个完整复合语句的一部分来使用
	如:
	     int m = i++ + ++i + i + i++; //这样写不但是不规范的,而且是不可移植
		 i++不知道是否允许.
		 printf("%d %d %d", i++, ++i, i);//违反了第二条
*/